seller-registration-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Reduce initial load to diagnose issues
    - duration: 30
      arrivalRate: 2  # Reduced from 5
      name: "Diagnostic phase"
    
    - duration: 60
      arrivalRate: 5   # Reduced from 10
      name: "Normal load"
    
    - duration: 120
      arrivalRate: 10  # Reduced from 20
      rampTo: 25       # Reduced from 50
      name: "Peak load"
    
    - duration: 180
      arrivalRate: 8   # Reduced from 15
      name: "Sustained load"

  defaults:
    headers:
      Content-Type: "application/json"

  # Remove capture until basic flow works
  ensure:
    thresholds:
      - http.response_time.p95: 500    # More realistic initial target
      - http.response_time.p99: 1000   # Reduced from 2000
      - http.request_rate: 5           # Reduced minimum
      - http.error_rate: 0.05          # More lenient error rate initially

scenarios:
  # Start with simpler test
  - name: "Basic OTP Flow"
    weight: 100  # Test one scenario first

    flow:
      # Step 1: Send OTP
      - post:
          url: "/api/v1/auth/send-otp"  # Ensure consistent endpoint
          json:
            phoneNo: "017{{ $randomNumber(10000000, 99999999) }}"
          expect:
            - statusCode: 200
          # Remove capture for now

      - think: 2

      # Step 2: Verify OTP (without capture)
      - post:
          url: "/api/v1/auth/verify-otp"  # Consistent endpoint
          json:
            phoneNo: "017{{ $randomNumber(10000000, 99999999) }}"
            otp: "000000"  # Use static OTP for testing
          expect:
            - statusCode: 400  # Expect failure with wrong OTP